/*
 * Created by JFormDesigner on Sat Feb 16 14:48:42 CST 2019
 */

package com.company;

import java.awt.*;
import java.awt.event.*;
import java.io.IOException;
import javax.swing.*;
import javax.swing.table.DefaultTableModel;

/**
 * @author Brainrain
 */
public class Setholidays extends JFrame {
    public Setholidays() {
        initComponents();
        loadTable();

    }

    private void SaveActionPerformed(ActionEvent e) {
        // TODO add your code here
        if(table1.isEditing()){
            table1.getCellEditor().stopCellEditing();
        }
        for(int i=0;i<table1.getRowCount();i++){
            if(table1.getValueAt(i,1).equals("是")||table1.getValueAt(i,1).equals("否")){


            }else {
                JOptionPane.showMessageDialog(null,"["+table1.getValueAt(i,0)+"]那行”是否假期“字段输入有误，只能输入“是”或者“否”");
                return;
            }


        }

        savaTable();
        JOptionPane.showMessageDialog(null,"保存成功");

    }

    private void button1ActionPerformed(ActionEvent e) {
        // TODO add your code here
        initTable();
    }

    private void initComponents() {
        // JFormDesigner - Component initialization - DO NOT MODIFY  //GEN-BEGIN:initComponents
        scrollPane1 = new JScrollPane();
        table1 = new JTable();
        Save = new JButton();
        button1 = new JButton();

        Container contentPane = getContentPane();
        contentPane.setLayout(null);

        scrollPane1.setViewportView(table1);
        contentPane.add(scrollPane1);
        scrollPane1.setBounds(0, 50, 535, 275);

        Save.setText("\u4fdd\u5b58"); //NON-NLS
        Save.addActionListener(e -> SaveActionPerformed(e));
        contentPane.add(Save);
        Save.setBounds(new Rectangle(new Point(10, 10), Save.getPreferredSize()));

        button1.setText("\u521d\u59cb\u5316"); //NON-NLS
        button1.addActionListener(e -> button1ActionPerformed(e));
        contentPane.add(button1);
        button1.setBounds(new Rectangle(new Point(85, 10), button1.getPreferredSize()));

        { // compute preferred size
            Dimension preferredSize = new Dimension();
            for(int i = 0; i < contentPane.getComponentCount(); i++) {
                Rectangle bounds = contentPane.getComponent(i).getBounds();
                preferredSize.width = Math.max(bounds.x + bounds.width, preferredSize.width);
                preferredSize.height = Math.max(bounds.y + bounds.height, preferredSize.height);
            }
            Insets insets = contentPane.getInsets();
            preferredSize.width += insets.right;
            preferredSize.height += insets.bottom;
            contentPane.setMinimumSize(preferredSize);
            contentPane.setPreferredSize(preferredSize);
        }

        pack();
        setLocationRelativeTo(getOwner());
        // JFormDesigner - End of component initialization  //GEN-END:initComponents
    }

    // JFormDesigner - Variables declaration - DO NOT MODIFY  //GEN-BEGIN:variables
    private JScrollPane scrollPane1;
    private JTable table1;
    private JButton Save;
    private JButton button1;
    // JFormDesigner - End of variables declaration  //GEN-END:variables

    public Object[][] queryTable(){
        Object[][] table=null;
        if(new Yearofday().isMoisteningYear()=="平年"){
            table=new Object[][] {
                    {"1月1日", "否"}, {"1月2日", "否"}, {"1月3日", "否"}, {"1月4日", "否"}, {"1月5日", "否"}, {"1月6日", "否"},
                    {"1月7日", "否"}, {"1月8日", "否"}, {"1月9日", "否"}, {"1月10日", "否"}, {"1月11日", "否"}, {"1月12日", "否"},
                    {"1月13日", "否"}, {"1月14日", "否"}, {"1月15日", "否"}, {"1月16日", "否"}, {"1月17日", "否"}, {"1月18日", "否"},
                    {"1月19日", "否"}, {"1月20日", "否"}, {"1月21日", "否"}, {"1月22日", "否"}, {"1月23日", "否"}, {"1月24日", "否"},
                    {"1月25日", "否"}, {"1月26日", "否"}, {"1月27日", "否"}, {"1月28日", "否"}, {"1月29日", "否"}, {"1月30日", "否"},
                    {"1月31日", "否"},
                    {"2月1日", "否"}, {"2月2日", "否"}, {"2月3日", "否"}, {"2月4日", "否"}, {"2月5日", "否"}, {"2月6日", "否"},
                    {"2月7日", "否"}, {"2月8日", "否"}, {"2月9日", "否"}, {"2月10日", "否"}, {"2月11日", "否"}, {"2月12日", "否"},
                    {"2月13日", "否"}, {"2月14日", "否"}, {"2月15日", "否"}, {"2月16日", "否"}, {"2月17日", "否"}, {"2月18日", "否"},
                    {"2月19日", "否"}, {"2月20日", "否"}, {"2月21日", "否"}, {"2月22日", "否"}, {"2月23日", "否"}, {"2月24日", "否"},
                    {"2月25日", "否"}, {"2月26日", "否"}, {"2月27日", "否"}, {"2月28日", "否"},
                    {"3月1日", "否"}, {"3月2日", "否"}, {"3月3日", "否"}, {"3月4日", "否"}, {"3月5日", "否"}, {"3月6日", "否"},
                    {"3月7日", "否"}, {"3月8日", "否"}, {"3月9日", "否"}, {"3月10日", "否"}, {"3月11日", "否"}, {"3月12日", "否"},
                    {"3月13日", "否"}, {"3月14日", "否"}, {"3月15日", "否"}, {"3月16日", "否"}, {"3月17日", "否"}, {"3月18日", "否"},
                    {"3月19日", "否"}, {"3月20日", "否"}, {"3月21日", "否"}, {"3月22日", "否"}, {"3月23日", "否"}, {"3月24日", "否"},
                    {"3月25日", "否"}, {"3月26日", "否"}, {"3月27日", "否"}, {"3月28日", "否"}, {"3月29日", "否"}, {"3月30日", "否"},
                    {"3月31日", "否"},
                    {"4月1日", "否"}, {"4月2日", "否"}, {"4月3日", "否"}, {"4月4日", "否"}, {"4月5日", "否"}, {"4月6日", "否"},
                    {"4月7日", "否"}, {"4月8日", "否"}, {"4月9日", "否"}, {"4月10日", "否"}, {"4月11日", "否"}, {"4月12日", "否"},
                    {"4月13日", "否"}, {"4月14日", "否"}, {"4月15日", "否"}, {"4月16日", "否"}, {"4月17日", "否"}, {"4月18日", "否"},
                    {"4月19日", "否"}, {"4月20日", "否"}, {"4月21日", "否"}, {"4月22日", "否"}, {"4月23日", "否"}, {"4月24日", "否"},
                    {"4月25日", "否"}, {"4月26日", "否"}, {"4月27日", "否"}, {"4月28日", "否"}, {"4月29日", "否"}, {"4月30日", "否"},
                    {"5月1日", "否"}, {"5月2日", "否"}, {"5月3日", "否"}, {"5月4日", "否"}, {"5月5日", "否"}, {"5月6日", "否"},
                    {"5月7日", "否"}, {"5月8日", "否"}, {"5月9日", "否"}, {"5月10日", "否"}, {"5月11日", "否"}, {"5月12日", "否"},
                    {"5月13日", "否"}, {"5月14日", "否"}, {"5月15日", "否"}, {"5月16日", "否"}, {"5月17日", "否"}, {"5月18日", "否"},
                    {"5月19日", "否"}, {"5月20日", "否"}, {"5月21日", "否"}, {"5月22日", "否"}, {"5月23日", "否"}, {"5月24日", "否"},
                    {"5月25日", "否"}, {"5月26日", "否"}, {"5月27日", "否"}, {"5月28日", "否"}, {"5月29日", "否"}, {"5月30日", "否"},
                    {"5月31日", "否"},
                    {"6月1日", "否"}, {"6月2日", "否"}, {"6月3日", "否"}, {"6月4日", "否"}, {"6月5日", "否"}, {"6月6日", "否"},
                    {"6月7日", "否"}, {"6月8日", "否"}, {"6月9日", "否"}, {"6月10日", "否"}, {"6月11日", "否"}, {"6月12日", "否"},
                    {"6月13日", "否"}, {"6月14日", "否"}, {"6月15日", "否"}, {"6月16日", "否"}, {"6月17日", "否"}, {"6月18日", "否"},
                    {"6月19日", "否"}, {"6月20日", "否"}, {"6月21日", "否"}, {"6月22日", "否"}, {"6月23日", "否"}, {"6月24日", "否"},
                    {"6月25日", "否"}, {"6月26日", "否"}, {"6月27日", "否"}, {"6月28日", "否"}, {"6月29日", "否"}, {"6月30日", "否"},
                    {"7月1日", "否"}, {"7月2日", "否"}, {"7月3日", "否"}, {"7月4日", "否"}, {"7月5日", "否"}, {"7月6日", "否"},
                    {"7月7日", "否"}, {"7月8日", "否"}, {"7月9日", "否"}, {"7月10日", "否"}, {"7月11日", "否"}, {"7月12日", "否"},
                    {"7月13日", "否"}, {"7月14日", "否"}, {"7月15日", "否"}, {"7月16日", "否"}, {"7月17日", "否"}, {"7月18日", "否"},
                    {"7月19日", "否"}, {"7月20日", "否"}, {"7月21日", "否"}, {"7月22日", "否"}, {"7月23日", "否"}, {"7月24日", "否"},
                    {"7月25日", "否"}, {"7月26日", "否"}, {"7月27日", "否"}, {"7月28日", "否"}, {"7月29日", "否"}, {"7月30日", "否"},
                    {"7月31日", "否"},
                    {"8月1日", "否"}, {"8月2日", "否"}, {"8月3日", "否"}, {"8月4日", "否"}, {"8月5日", "否"}, {"8月6日", "否"},
                    {"8月7日", "否"}, {"8月8日", "否"}, {"8月9日", "否"}, {"8月10日", "否"}, {"8月11日", "否"}, {"8月12日", "否"},
                    {"8月13日", "否"}, {"8月14日", "否"}, {"8月15日", "否"}, {"8月16日", "否"}, {"8月17日", "否"}, {"8月18日", "否"},
                    {"8月19日", "否"}, {"8月20日", "否"}, {"8月21日", "否"}, {"8月22日", "否"}, {"8月23日", "否"}, {"8月24日", "否"},
                    {"8月25日", "否"}, {"8月26日", "否"}, {"8月27日", "否"}, {"8月28日", "否"}, {"8月29日", "否"}, {"8月30日", "否"},
                    {"8月31日", "否"},
                    {"9月1日", "否"}, {"9月2日", "否"}, {"9月3日", "否"}, {"9月4日", "否"}, {"9月5日", "否"}, {"9月6日", "否"},
                    {"9月7日", "否"}, {"9月8日", "否"}, {"9月9日", "否"}, {"9月10日", "否"}, {"9月11日", "否"}, {"9月12日", "否"},
                    {"9月13日", "否"}, {"9月14日", "否"}, {"9月15日", "否"}, {"9月16日", "否"}, {"9月17日", "否"}, {"9月18日", "否"},
                    {"9月19日", "否"}, {"9月20日", "否"}, {"9月21日", "否"}, {"9月22日", "否"}, {"9月23日", "否"}, {"9月24日", "否"},
                    {"9月25日", "否"}, {"9月26日", "否"}, {"9月27日", "否"}, {"9月28日", "否"}, {"9月29日", "否"}, {"9月30日", "否"},
                    {"10月1日", "否"}, {"10月2日", "否"}, {"10月3日", "否"}, {"10月4日", "否"}, {"10月5日", "否"}, {"10月6日", "否"},
                    {"10月7日", "否"}, {"10月8日", "否"}, {"10月9日", "否"}, {"10月10日", "否"}, {"10月11日", "否"}, {"10月12日", "否"},
                    {"10月13日", "否"}, {"10月14日", "否"}, {"10月15日", "否"}, {"10月16日", "否"}, {"10月17日", "否"}, {"10月18日", "否"},
                    {"10月19日", "否"}, {"10月20日", "否"}, {"10月21日", "否"}, {"10月22日", "否"}, {"10月23日", "否"}, {"10月24日", "否"},
                    {"10月25日", "否"}, {"10月26日", "否"}, {"10月27日", "否"}, {"10月28日", "否"}, {"10月29日", "否"}, {"10月30日", "否"},
                    {"10月31日", "否"},
                    {"11月1日", "否"}, {"11月2日", "否"}, {"11月3日", "否"}, {"11月4日", "否"}, {"11月5日", "否"}, {"11月6日", "否"},
                    {"11月7日", "否"}, {"11月8日", "否"}, {"11月9日", "否"}, {"11月10日", "否"}, {"11月11日", "否"}, {"11月12日", "否"},
                    {"11月13日", "否"}, {"11月14日", "否"}, {"11月15日", "否"}, {"11月16日", "否"}, {"11月17日", "否"}, {"11月18日", "否"},
                    {"11月19日", "否"}, {"11月20日", "否"}, {"11月21日", "否"}, {"11月22日", "否"}, {"11月23日", "否"}, {"11月24日", "否"},
                    {"11月25日", "否"}, {"11月26日", "否"}, {"11月27日", "否"}, {"11月28日", "否"}, {"11月29日", "否"}, {"11月30日", "否"},
                    {"12月1日", "否"}, {"12月2日", "否"}, {"12月3日", "否"}, {"12月4日", "否"}, {"12月5日", "否"}, {"12月6日", "否"},
                    {"12月7日", "否"}, {"12月8日", "否"}, {"12月9日", "否"}, {"12月10日", "否"}, {"12月11日", "否"}, {"12月12日", "否"},
                    {"12月13日", "否"}, {"12月14日", "否"}, {"12月15日", "否"}, {"12月16日", "否"}, {"12月17日", "否"}, {"12月18日", "否"},
                    {"12月19日", "否"}, {"12月20日", "否"}, {"12月21日", "否"}, {"12月22日", "否"}, {"12月23日", "否"}, {"12月24日", "否"},
                    {"12月25日", "否"}, {"12月26日", "否"}, {"12月27日", "否"}, {"12月28日", "否"}, {"12月29日", "否"}, {"12月30日", "否"},
                    {"12月31日", "否"},
            };
        }else {
            table=new Object[][] {
                    {"1月1日", "否"}, {"1月2日", "否"}, {"1月3日", "否"}, {"1月4日", "否"}, {"1月5日", "否"}, {"1月6日", "否"},
                    {"1月7日", "否"}, {"1月8日", "否"}, {"1月9日", "否"}, {"1月10日", "否"}, {"1月11日", "否"}, {"1月12日", "否"},
                    {"1月13日", "否"}, {"1月14日", "否"}, {"1月15日", "否"}, {"1月16日", "否"}, {"1月17日", "否"}, {"1月18日", "否"},
                    {"1月19日", "否"}, {"1月20日", "否"}, {"1月21日", "否"}, {"1月22日", "否"}, {"1月23日", "否"}, {"1月24日", "否"},
                    {"1月25日", "否"}, {"1月26日", "否"}, {"1月27日", "否"}, {"1月28日", "否"}, {"1月29日", "否"}, {"1月30日", "否"},
                    {"1月31日", "否"},
                    {"2月1日", "否"}, {"2月2日", "否"}, {"2月3日", "否"}, {"2月4日", "否"}, {"2月5日", "否"}, {"2月6日", "否"},
                    {"2月7日", "否"}, {"2月8日", "否"}, {"2月9日", "否"}, {"2月10日", "否"}, {"2月11日", "否"}, {"2月12日", "否"},
                    {"2月13日", "否"}, {"2月14日", "否"}, {"2月15日", "否"}, {"2月16日", "否"}, {"2月17日", "否"}, {"2月18日", "否"},
                    {"2月19日", "否"}, {"2月20日", "否"}, {"2月21日", "否"}, {"2月22日", "否"}, {"2月23日", "否"}, {"2月24日", "否"},
                    {"2月25日", "否"}, {"2月26日", "否"}, {"2月27日", "否"}, {"2月28日", "否"},{"2月29日", "否"},
                    {"3月1日", "否"}, {"3月2日", "否"}, {"3月3日", "否"}, {"3月4日", "否"}, {"3月5日", "否"}, {"3月6日", "否"},
                    {"3月7日", "否"}, {"3月8日", "否"}, {"3月9日", "否"}, {"3月10日", "否"}, {"3月11日", "否"}, {"3月12日", "否"},
                    {"3月13日", "否"}, {"3月14日", "否"}, {"3月15日", "否"}, {"3月16日", "否"}, {"3月17日", "否"}, {"3月18日", "否"},
                    {"3月19日", "否"}, {"3月20日", "否"}, {"3月21日", "否"}, {"3月22日", "否"}, {"3月23日", "否"}, {"3月24日", "否"},
                    {"3月25日", "否"}, {"3月26日", "否"}, {"3月27日", "否"}, {"3月28日", "否"}, {"3月29日", "否"}, {"3月30日", "否"},
                    {"3月31日", "否"},
                    {"4月1日", "否"}, {"4月2日", "否"}, {"4月3日", "否"}, {"4月4日", "否"}, {"4月5日", "否"}, {"4月6日", "否"},
                    {"4月7日", "否"}, {"4月8日", "否"}, {"4月9日", "否"}, {"4月10日", "否"}, {"4月11日", "否"}, {"4月12日", "否"},
                    {"4月13日", "否"}, {"4月14日", "否"}, {"4月15日", "否"}, {"4月16日", "否"}, {"4月17日", "否"}, {"4月18日", "否"},
                    {"4月19日", "否"}, {"4月20日", "否"}, {"4月21日", "否"}, {"4月22日", "否"}, {"4月23日", "否"}, {"4月24日", "否"},
                    {"4月25日", "否"}, {"4月26日", "否"}, {"4月27日", "否"}, {"4月28日", "否"}, {"4月29日", "否"}, {"4月30日", "否"},
                    {"5月1日", "否"}, {"5月2日", "否"}, {"5月3日", "否"}, {"5月4日", "否"}, {"5月5日", "否"}, {"5月6日", "否"},
                    {"5月7日", "否"}, {"5月8日", "否"}, {"5月9日", "否"}, {"5月10日", "否"}, {"5月11日", "否"}, {"5月12日", "否"},
                    {"5月13日", "否"}, {"5月14日", "否"}, {"5月15日", "否"}, {"5月16日", "否"}, {"5月17日", "否"}, {"5月18日", "否"},
                    {"5月19日", "否"}, {"5月20日", "否"}, {"5月21日", "否"}, {"5月22日", "否"}, {"5月23日", "否"}, {"5月24日", "否"},
                    {"5月25日", "否"}, {"5月26日", "否"}, {"5月27日", "否"}, {"5月28日", "否"}, {"5月29日", "否"}, {"5月30日", "否"},
                    {"5月31日", "否"},
                    {"6月1日", "否"}, {"6月2日", "否"}, {"6月3日", "否"}, {"6月4日", "否"}, {"6月5日", "否"}, {"6月6日", "否"},
                    {"6月7日", "否"}, {"6月8日", "否"}, {"6月9日", "否"}, {"6月10日", "否"}, {"6月11日", "否"}, {"6月12日", "否"},
                    {"6月13日", "否"}, {"6月14日", "否"}, {"6月15日", "否"}, {"6月16日", "否"}, {"6月17日", "否"}, {"6月18日", "否"},
                    {"6月19日", "否"}, {"6月20日", "否"}, {"6月21日", "否"}, {"6月22日", "否"}, {"6月23日", "否"}, {"6月24日", "否"},
                    {"6月25日", "否"}, {"6月26日", "否"}, {"6月27日", "否"}, {"6月28日", "否"}, {"6月29日", "否"}, {"6月30日", "否"},
                    {"7月1日", "否"}, {"7月2日", "否"}, {"7月3日", "否"}, {"7月4日", "否"}, {"7月5日", "否"}, {"7月6日", "否"},
                    {"7月7日", "否"}, {"7月8日", "否"}, {"7月9日", "否"}, {"7月10日", "否"}, {"7月11日", "否"}, {"7月12日", "否"},
                    {"7月13日", "否"}, {"7月14日", "否"}, {"7月15日", "否"}, {"7月16日", "否"}, {"7月17日", "否"}, {"7月18日", "否"},
                    {"7月19日", "否"}, {"7月20日", "否"}, {"7月21日", "否"}, {"7月22日", "否"}, {"7月23日", "否"}, {"7月24日", "否"},
                    {"7月25日", "否"}, {"7月26日", "否"}, {"7月27日", "否"}, {"7月28日", "否"}, {"7月29日", "否"}, {"7月30日", "否"},
                    {"7月31日", "否"},
                    {"8月1日", "否"}, {"8月2日", "否"}, {"8月3日", "否"}, {"8月4日", "否"}, {"8月5日", "否"}, {"8月6日", "否"},
                    {"8月7日", "否"}, {"8月8日", "否"}, {"8月9日", "否"}, {"8月10日", "否"}, {"8月11日", "否"}, {"8月12日", "否"},
                    {"8月13日", "否"}, {"8月14日", "否"}, {"8月15日", "否"}, {"8月16日", "否"}, {"8月17日", "否"}, {"8月18日", "否"},
                    {"8月19日", "否"}, {"8月20日", "否"}, {"8月21日", "否"}, {"8月22日", "否"}, {"8月23日", "否"}, {"8月24日", "否"},
                    {"8月25日", "否"}, {"8月26日", "否"}, {"8月27日", "否"}, {"8月28日", "否"}, {"8月29日", "否"}, {"8月30日", "否"},
                    {"8月31日", "否"},
                    {"9月1日", "否"}, {"9月2日", "否"}, {"9月3日", "否"}, {"9月4日", "否"}, {"9月5日", "否"}, {"9月6日", "否"},
                    {"9月7日", "否"}, {"9月8日", "否"}, {"9月9日", "否"}, {"9月10日", "否"}, {"9月11日", "否"}, {"9月12日", "否"},
                    {"9月13日", "否"}, {"9月14日", "否"}, {"9月15日", "否"}, {"9月16日", "否"}, {"9月17日", "否"}, {"9月18日", "否"},
                    {"9月19日", "否"}, {"9月20日", "否"}, {"9月21日", "否"}, {"9月22日", "否"}, {"9月23日", "否"}, {"9月24日", "否"},
                    {"9月25日", "否"}, {"9月26日", "否"}, {"9月27日", "否"}, {"9月28日", "否"}, {"9月29日", "否"}, {"9月30日", "否"},
                    {"10月1日", "否"}, {"10月2日", "否"}, {"10月3日", "否"}, {"10月4日", "否"}, {"10月5日", "否"}, {"10月6日", "否"},
                    {"10月7日", "否"}, {"10月8日", "否"}, {"10月9日", "否"}, {"10月10日", "否"}, {"10月11日", "否"}, {"10月12日", "否"},
                    {"10月13日", "否"}, {"10月14日", "否"}, {"10月15日", "否"}, {"10月16日", "否"}, {"10月17日", "否"}, {"10月18日", "否"},
                    {"10月19日", "否"}, {"10月20日", "否"}, {"10月21日", "否"}, {"10月22日", "否"}, {"10月23日", "否"}, {"10月24日", "否"},
                    {"10月25日", "否"}, {"10月26日", "否"}, {"10月27日", "否"}, {"10月28日", "否"}, {"10月29日", "否"}, {"10月30日", "否"},
                    {"10月31日", "否"},
                    {"11月1日", "否"}, {"11月2日", "否"}, {"11月3日", "否"}, {"11月4日", "否"}, {"11月5日", "否"}, {"11月6日", "否"},
                    {"11月7日", "否"}, {"11月8日", "否"}, {"11月9日", "否"}, {"11月10日", "否"}, {"11月11日", "否"}, {"11月12日", "否"},
                    {"11月13日", "否"}, {"11月14日", "否"}, {"11月15日", "否"}, {"11月16日", "否"}, {"11月17日", "否"}, {"11月18日", "否"},
                    {"11月19日", "否"}, {"11月20日", "否"}, {"11月21日", "否"}, {"11月22日", "否"}, {"11月23日", "否"}, {"11月24日", "否"},
                    {"11月25日", "否"}, {"11月26日", "否"}, {"11月27日", "否"}, {"11月28日", "否"}, {"11月29日", "否"}, {"11月30日", "否"},
                    {"12月1日", "否"}, {"12月2日", "否"}, {"12月3日", "否"}, {"12月4日", "否"}, {"12月5日", "否"}, {"12月6日", "否"},
                    {"12月7日", "否"}, {"12月8日", "否"}, {"12月9日", "否"}, {"12月10日", "否"}, {"12月11日", "否"}, {"12月12日", "否"},
                    {"12月13日", "否"}, {"12月14日", "否"}, {"12月15日", "否"}, {"12月16日", "否"}, {"12月17日", "否"}, {"12月18日", "否"},
                    {"12月19日", "否"}, {"12月20日", "否"}, {"12月21日", "否"}, {"12月22日", "否"}, {"12月23日", "否"}, {"12月24日", "否"},
                    {"12月25日", "否"}, {"12月26日", "否"}, {"12月27日", "否"}, {"12月28日", "否"}, {"12月29日", "否"}, {"12月30日", "否"},
                    {"12月31日", "否"},
            };
        }



        return table;
    }

    public void  initTable(){
        Object[][] data = null;
        String head[] = new String[]{"日期", "是否假期"};
        DefaultTableModel tableModel = new DefaultTableModel(queryTable(), head) {
            @Override
            public boolean isCellEditable(int row, int column) {
                if (column == 0) {
                    return false;
                } else {
                    return true;
                }
            }
        };
        table1.setModel(tableModel);
    }

    private void loadTable(){
        table1.setModel(new Configure().getModel("lib/jiaqibiao.xml"));
    }

    private void savaTable(){
        new Configure().saveModel(table1.getModel(),"lib/jiaqibiao.xml");
    }
}
